cases/laminarMHDDuct/0.orgHunt/PotE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      PotE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type    cyclic;
    }
    outlet
    {
        type    cyclic;
    }
    lowerWall
    {
        type    fixedValue;
        value   uniform 0;
    }
    upperWall
    {
        type    fixedValue;
        value   uniform 0;
    }
    rightWall
    {
        type    zeroGradient;
    }
    leftWall
    {
        type    zeroGradient;
    }
}

// ************************************************************************* //
