cases/laminarMHDDuct/constant/OmegaS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "constant";
    object      OmegaS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];


internalField   nonuniform List<scalar> 
3120
(
0.000413539146
0.000413539146
0.000450095346
0.000450095346
0.000489883055
0.000489883055
0.000533187933
0.000533187934
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
1600
(
0.000198017364
0.000215521782
0.000234573564
0.000255309492
0.000277878442
0.000302442451
0.00032917788
0.000358276679
...
)
;
    }
    outlet
    {
        type            cyclic;
        value           nonuniform List<scalar> 
1600
(
0.000198017364
0.000215521782
0.000234573564
0.000255309492
0.000277878442
0.000302442451
0.00032917788
0.000358276679
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.000198017364
0.000215521782
0.000234573564
0.000255309492
0.000277878442
0.000302442451
0.00032917788
0.000358276679
...
)
;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.000198017364
0.000215521782
0.000234573564
0.000255309492
0.000277878442
0.000302442451
0.00032917788
0.000358276679
...
)
;
    }
    leftWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.000198017364
0.000215521782
0.000234573564
0.000255309492
0.000277878442
0.000302442451
0.00032917788
0.000358276679
...
)
;
    }
    rightWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.000198017364
0.000215521782
0.000234573564
0.000255309492
0.000277878442
0.000302442451
0.00032917788
0.000358276679
...
)
;
    }
}


// ************************************************************************* //
