cases/laminarMHDDuct/constant/fvOptionsGradp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forcing
{
    type            vectorSemiImplicitSource;
    active          yes;

    vectorSemiImplicitSourceCoeffs
    {
        selectionMode   all;
        volumeMode      specific;

        injectionRateSuSp
        {
            U           ((0.19036354338559022 0 0) 0);
        }
    }
}

// ************************************************************************* //
