cases/laminarMHDDuct/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         RKSymMagFoam;

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             100;

deltaT              0.1;

writeControl        adjustableRunTime;

writeInterval       10;

purgeWrite          0;

writeFormat         ascii;

writePrecision      9;

writeCompression    off;

timeFormat          general;

timePrecision       9;

runTimeModifiable   true;

adjustTimeStep      false;

functions
{
    UAvg
    {
        type            volFieldValue;
        libs            ("fieldFunctionObjects.so");
        operation       volAverage;
        regionType      all;

        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             true;

        fields
        (
            U
        );
    }

    flowRate
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        operation       sum;
        regionType      patch;
        name            outlet;

        executeControl  timeStep;
        executeInterval 1;
        writeControl    timeStep;
        writeInterval   1;
        writeFields     false;
        log             true;

        fields
        (
            phi
        );
    }

    lineSample
    {
        type        sets;
        libs        (sampling);
        setFormat   raw;

        writeControl    timeStep;
        writeInterval   1;

        fields
        (
            U
        );

        interpolationScheme cell;

        sets
        (
            vertical
            {
                type    midPoint;
                axis    y;
                start   (0.5 -1.0 0.0);
                end     (0.5  1.0 0.0);
            }
            horizontal
            {
                type    midPoint;
                axis    z;
                start   (0.5 0.0 -1.0);
                end     (0.5 0.0  1.0);
            }
        );
    }
}

// ************************************************************************* //
