cases/laminarMHDDuct/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pCorr)"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        relTol          0.001;
        tolerance       0;
    }

    "(p|pCorr)Final"
    {
        $pCorr;
        smoother        DICGaussSeidel;
        relTol          0;
        tolerance       1e-6;
    }

    "(PotE|PotECorr)"
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
}

RungeKutta
{
    scheme          Kutta;
    nOuter          1;
    nInner          1;
    pnPredCoef      1;
    pRefCell        0;
    pRefValue       0;
}

PotE
{
    PotEnPredCoef   0;
    PotERefCell     0;
    PotERefValue    0;
}

// ************************************************************************* //
